/// lib/utils/hidden_stems.dart
/// 지장간(藏干) 매핑: 각 지지(地支)에 숨겨진 천간(天干) 리스트
const Map<String, List<String>> hiddenStems = {
  '子': ['壬', '  ', '癸'],  // 자(임, ,계)
  '丑': ['癸', '辛', '己'],  // 축(계,신,기)
  '寅': ['戊', '丙', '甲'],  // 인(무,병,갑)
  '卯': ['甲', '  ', '乙'],  // 묘(갑, ,을)
  '辰': ['戊', '乙', '癸'],  // 진(무,을,계)
  '巳': ['戊', '庚', '丙'],  // 사(무,경,병)
  '午': ['丁', '乙', '己'],  // 오(정,을,기)
  '未': ['丁', '乙', '己'],  // 미(기,정,을)
  '申': ['戊', '壬', '庚'],  // 신(무,임,경)
  '酉': ['庚', '  ', '辛'],  // 유(경, ,신)
  '戌': ['辛', '丁', '戊'],  // 술(신,정,무)
  '亥': ['戊', '甲', '壬'],  // 해(무,갑,임)
};
